Австралия/src/InformationRegisters/SenderSettings/SenderSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SenderSettings</name>
  <comment>Used to store links between channels and their recipients. The register defines a mailing to recipients from the sender side.</comment>
  <dimensions>
    <name>MessagesChannel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Recipient</name>
    <type>
      <types>ExchangePlanRef.MessageExchange</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/SenderSettings/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Defines endpoints of the specified in the current infosystem massage channel.
// 
//
// Parameters:
//  MessageChannel - String. Targeted message channel ID.
//
// Returns:
//  Type: Array. Endpoints items array.
//  Array contains items of ExchangePlanRef.MessageExchange type.
//
Function MessageChannelSubscribers(Val MessagesChannel) Export
	
	QueryText =
	"SELECT
	|	SenderSettings.Recipient AS Recipient
	|FROM
	|	InformationRegister.SenderSettings AS SenderSettings
	|WHERE
	|	SenderSettings.MessagesChannel = &MessagesChannel";
	
	Query = New Query;
	Query.SetParameter("MessagesChannel", MessagesChannel);
	Query.Text = QueryText;
	
	Return Query.Execute().Unload().UnloadColumn("Recipient");
EndFunction

#EndRegion

#EndIf
